sahadv/Two-Axis-Machine/STM32CubeExpansion-SPN2_V1.1.0/Projects/Src/example_usart.c
/**
 ******************************************************************************
 * @file       nucleo_xnucleo_usart.c
 * @date       01/10/2014 12:00:00
 * @brief      This file provides the functions to send commands to the L6470
 *             via Nucleo USART 
 ******************************************************************************
 *
 * COPYRIGHT(c) 2014 STMicroelectronics
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

#include "example_usart.h"
#include "xnucleoihm02a1.h"
#include "params.h"

/**
 * @addtogroup MicrosteppingMotor_Example
 * @{
 */

/**
 * @addtogroup   ExampleUsart
 * @{
 */

/**
 * @addtogroup ExampleUsartPrivateTypes
 * @{
 */

/**
 * @brief The states while USART text decoding
 */
typedef enum {
	DECODE_MOTOR,       //!< Motor name decoding
	DECODE_COMMAND,     //!< L6470 Application Commad decoding
	DECODE_1st_PARAM,   //!< L6470 Application Commad 1st parameter decoding
	DECODE_2nd_PARAM,   //!< L6470 Application Commad 2nd parameter decoding
	DECODE_3rd_PARAM,   //!< L6470 Application Commad 3rd parameter decoding
} eL6470_UsartTextStringDecodingStatus;

/**
 * @}
 *//* End of ExampleUsartPrivateTypes */

/**
 * @addtogroup ExampleUsartPrivateMacros
 * @{
 */

#define NucleoUsartReceiveIT    HAL_UART_Receive_IT     //!< Rename the HAL function to receive an amount of data in non blocking mode.
#ifdef STM32F072xB
#define NUCLEO_BOARD_NAME       "NUCLEO-F072RB"
#define USART_STATUS_REGISTER   ISR                     //!< HAL USART status register name adapter.
#define USART_DATA_REGISTER     RDR                     //!< HAL UART data register name adapter.
#endif
#ifdef STM32F302x8
#define NUCLEO_BOARD_NAME       "NUCLEO-F302R8"
#define USART_STATUS_REGISTER   ISR                     //!< HAL USART status register name adapter.
#define USART_DATA_REGISTER     RDR                     //!< HAL UART data register name adapter.
#endif
#ifdef STM32F401xE
#define NUCLEO_BOARD_NAME       "NUCLEO-F401RE"
#define USART_STATUS_REGISTER   SR                      //!< HAL USART status register name adapter.
#define USART_DATA_REGISTER     DR                      //!< HAL UART data register name adapter.
#endif

/**
 * @}
 *//* End of ExampleUsartPrivateMacros */

/**
 * @addtogroup ExampleUsartPrivateVariables
 * @{
 */

UART_HandleTypeDef huart2; //!< The data structure for all further instances to USART2.
sL6470_DaisyChainMnemonic L6470_DaisyChainMnemonic[L6470DAISYCHAINSIZE]; //!< The mnemonic names for the L6470 in the daisy chain configuration
uint8_t UsartTextString[USARTTEXTSTRINGSIZE]; //!< To store the USART input text string.
sL6470_TextCommandBundle L6470_TextCommandBundle[L6470DAISYCHAINSIZE]; //!< To store the splitted USART input text string into single fileds.

/**
 * @}
 *//* End of ExampleUsartPrivateVariables */

/**
 * @defgroup   ExampleUsartPrivateFunctions
 * @{
 */

FlagStatus USART_SplitTextString(uint8_t *pTextString,
		sL6470_TextCommandBundle *pL6470_TextCommandBundle);
FlagStatus USART_CheckTextCommandBundle(
		sL6470_TextCommandBundle *pL6470_TextCommandBundle,
		uint8_t* pL6470_DaisyChainSpiTxStruct);
uint32_t* USART_DecodeTextString(uint8_t *pTextString,
		sL6470_TextCommandBundle *pL6470_TextCommandBundle,
		uint8_t* pL6470_DaisyChainSpiTxStruct,
		uint8_t* pL6470_DaisyChainSpiRxStruct);
FlagStatus CompareTwoTextString(uint8_t* TextString1, uint8_t* TextString2);
FlagStatus str2num(uint8_t* str, uint32_t* pnum);

/**
 * @}
 *//* End of ExampleUsartPrivateFunctions */

/**
 * @addtogroup ExampleUsartPrivateFunctions
 * @{
 */

/**
 * @brief Split the whole command string entered via USART into single text
 *        strings to be used
 * @retval FlagStatus  SET or RESET related to the result
 */
FlagStatus USART_SplitTextString(uint8_t *pTextString,
		sL6470_TextCommandBundle *pL6470_TextCommandBundle) {
	uint8_t CmdTxt_id; /* To index the text command string inside the whole text string */
	uint8_t c_id; /* To index the characters of the command string */
	uint8_t ch; /* The actual character to be checked */
	uint8_t k_id; /* To index the characters of each word of the command string */
	uint8_t k_idmax; /* To store the actual max value for k */
	eL6470_UsartTextStringDecodingStatus UsartTextStringDecodingStatus; /* The store the actual state for USART text decoding */

	for (CmdTxt_id = 0; CmdTxt_id < L6470DAISYCHAINSIZE; CmdTxt_id++) {
		*((pL6470_TextCommandBundle + CmdTxt_id)->MotorName) = '\0';
		*((pL6470_TextCommandBundle + CmdTxt_id)->CommandName) = '\0';
		*((pL6470_TextCommandBundle + CmdTxt_id)->Param[0]) = '\0';
		*((pL6470_TextCommandBundle + CmdTxt_id)->Param[1]) = '\0';
		*((pL6470_TextCommandBundle + CmdTxt_id)->Param[2]) = '\0';
	}

