sahadv/Two-Axis-Machine/STM32CubeExpansion-SPN2_V1.1.0/Projects/Src/example_usart.c
				/* Build the others bytes to transmit (SPD) */
				for (spibyte = 1; spibyte < (3 + 1); spibyte++) {
					*(pL6470_DaisyChainSpiTxStruct
							+ ((spibyte * L6470DAISYCHAINSIZE) + L6470_Id)) =
							(uint8_t) (NumericValue >> (8 * (3 - spibyte)));
				}
				break;
			case L6470_STEPCLOCK_ID:
				/* Checks the Motor Direction that has been entered */
				L6470_DirId = (eL6470_DirId_t) 0;
				while (!CompareTwoTextString(
						(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->Param[0],
						(uint8_t*) L6470_Direction[L6470_DirId].Mnemonic)) {
					L6470_DirId++;
					if (L6470_DirId == L6470DIRIDSIZE) {
#ifdef NUCLEO_USE_USART
						USART_Transmit(&huart2,
								"It is not possible to recognize any direction.\n\r\n\r");
#endif
						return RESET;
					}
				}
				/* The application command parameter (as DIR) is known ************** */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0x58
						| L6470_DirId;
				break;
			case L6470_MOVE_ID:
				/* Checks the Motor Direction that has been entered (as 1st parameter) */
				L6470_DirId = (eL6470_DirId_t) 0;
				while (!CompareTwoTextString(
						(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->Param[0],
						(uint8_t*) L6470_Direction[L6470_DirId].Mnemonic)) {
					L6470_DirId++;
					if (L6470_DirId == L6470DIRIDSIZE) {
#ifdef NUCLEO_USE_USART
						USART_Transmit(&huart2,
								"It is not possible to recognize any direction.\n\r\n\r");
#endif
						return RESET;
					}
				}
				/* The 1st application command parameter (as DIR) is known ************** */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0x40
						| L6470_DirId;

				/* Checks the numeric parameter that has been entered (as 2nd parameter) */
				if (!str2num(
						(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->Param[1],
						&NumericValue)) {
#ifdef NUCLEO_USE_USART
					USART_Transmit(&huart2,
							"It is not possible to recognize any numeric value.\n\r\n\r");
#endif
					return RESET;
				}
				/* The 2nd application command parameter (as a numeric value) is known */

				/* Build the others bytes to transmit (N_STEP) */
				for (spibyte = 1; spibyte < (3 + 1); spibyte++) {
					*(pL6470_DaisyChainSpiTxStruct
							+ ((spibyte * L6470DAISYCHAINSIZE) + L6470_Id)) =
							(uint8_t) (NumericValue >> (8 * (3 - spibyte)));
				}
				break;
			case L6470_GOTO_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0x60;

				/* Checks the numeric parameter that has been entered */
				if (!str2num(
						(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->Param[0],
						&NumericValue)) {
#ifdef NUCLEO_USE_USART
					USART_Transmit(&huart2,
							"It is not possible to recognize any numeric value.\n\r\n\r");
#endif
					return RESET;
				}
				/* The application command parameter (as a numeric value) is known */

				/* Build the others bytes to transmit (ABS_POS) */
				for (spibyte = 1; spibyte < (3 + 1); spibyte++) {
					*(pL6470_DaisyChainSpiTxStruct
							+ ((spibyte * L6470DAISYCHAINSIZE) + L6470_Id)) =
							(uint8_t) (NumericValue >> (8 * (3 - spibyte)));
				}
				break;
			case L6470_GOTODIR_ID:
				/* Checks the Motor Direction that has been entered (as 1st parameter) */
				L6470_DirId = (eL6470_DirId_t) 0;
				while (!CompareTwoTextString(
						(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->Param[0],
						(uint8_t*) L6470_Direction[L6470_DirId].Mnemonic)) {
					L6470_DirId++;
					if (L6470_DirId == L6470DIRIDSIZE) {
#ifdef NUCLEO_USE_USART
						USART_Transmit(&huart2,
								"It is not possible to recognize any direction.\n\r\n\r");
#endif
						return RESET;
					}
				}
				/* The 1st application command parameter (as DIR) is known ************** */
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0x68
						| L6470_DirId;

				/* Checks the numeric parameter that has been entered (as 2nd parameter) */
				if (!str2num(
						(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->Param[1],
						&NumericValue)) {
#ifdef NUCLEO_USE_USART
					USART_Transmit(&huart2,
							"It is not possible to recognize any numeric value.\n\r\n\r");
#endif
					return RESET;
				}
				/* The 2nd application command parameter (as a numeric value) is known */

				/* Build the others bytes to transmit (ABS_POS) */
				for (spibyte = 1; spibyte < (3 + 1); spibyte++) {
					*(pL6470_DaisyChainSpiTxStruct
							+ ((spibyte * L6470DAISYCHAINSIZE) + L6470_Id)) =
							(uint8_t) (NumericValue >> (8 * (3 - spibyte)));
				}
				break;
			case L6470_GOUNTIL_ID:
				/* Checks the Action about ABS_POS register that has been entered (as 1st parameter) */
				L6470_ActId = (eL6470_ActId_t) 0;
				while (!CompareTwoTextString(
						(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->Param[0],
						(uint8_t*) L6470_ACT[L6470_ActId].Mnemonic)) {
					L6470_ActId++;
					if (L6470_ActId == L6470ACTIDSIZE) {
#ifdef NUCLEO_USE_USART
						USART_Transmit(&huart2,
								"It is not possible to recognize any action.\n\r\n\r");
#endif
						return RESET;
					}
				}
				/* The 1st application command parameter (as ACT) is known **************** */
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0x82
						| (L6470_ActId << 3);

				/* Checks the Motor Direction that has been entered (as 2nd parameter) */
				L6470_DirId = (eL6470_DirId_t) 0;
				while (!CompareTwoTextString(
						(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->Param[1],
						(uint8_t*) L6470_Direction[L6470_DirId].Mnemonic)) {
					L6470_DirId++;
					if (L6470_DirId == L6470DIRIDSIZE) {
#ifdef NUCLEO_USE_USART
						USART_Transmit(&huart2,
								"It is not possible to recognize any direction.\n\r\n\r");
#endif
						return RESET;
					}
				}
				/* The 2nd application command parameter (as DIR) is known ************** */
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) |=
						L6470_DirId;

				/* Checks the numeric parameter that has been entered (as 3rd parameter) */
				if (!str2num(
						(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->Param[2],
						&NumericValue)) {
#ifdef NUCLEO_USE_USART
					USART_Transmit(&huart2,
							"It is not possible to recognize any numeric value.\n\r\n\r");
#endif
					return RESET;
				}
				/* The 3rd application command parameter (as a numeric value) is known */

