sahadv/Two-Axis-Machine/STM32CubeExpansion-SPN2_V1.1.0/Projects/Src/example_usart.c
				/* Build the others bytes to transmit (SPD) */
				for (spibyte = 1; spibyte < (3 + 1); spibyte++) {
					*(pL6470_DaisyChainSpiTxStruct
							+ ((spibyte * L6470DAISYCHAINSIZE) + L6470_Id)) =
							(uint8_t) (NumericValue >> (8 * (3 - spibyte)));
				}
				break;
			case L6470_RELEASESW_ID:
				/* Checks the Action about ABS_POS register that has been entered (as 1st parameter) */
				L6470_ActId = (eL6470_ActId_t) 0;
				while (!CompareTwoTextString(
						(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->Param[0],
						(uint8_t*) L6470_ACT[L6470_ActId].Mnemonic)) {
					L6470_ActId++;
					if (L6470_ActId == L6470ACTIDSIZE) {
#ifdef NUCLEO_USE_USART
						USART_Transmit(&huart2,
								"It is not possible to recognize any action.\n\r\n\r");
#endif
						return RESET;
					}
				}
				/* The 1st application command parameter (as ACT) is known **************** */
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0x92
						| (L6470_ActId << 3);

				/* Checks the Motor Direction that has been entered (as 2nd parameter) */
				L6470_DirId = (eL6470_DirId_t) 0;
				while (!CompareTwoTextString(
						(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->Param[1],
						(uint8_t*) L6470_Direction[L6470_DirId].Mnemonic)) {
					L6470_DirId++;
					if (L6470_DirId == L6470DIRIDSIZE) {
#ifdef NUCLEO_USE_USART
						USART_Transmit(&huart2,
								"It is not possible to recognize any direction.\n\r\n\r");
#endif
						return RESET;
					}
				}
				/* The 2nd application command parameter (as DIR) is known ************** */
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) |=
						L6470_DirId;
				break;
			case L6470_GOHOME_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0x70;
				break;
			case L6470_GOMARK_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0x78;
				break;
			case L6470_RESETPOS_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0xD8;
				break;
			case L6470_RESETDEVICE_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0xC0;
				break;
			case L6470_SOFTSTOP_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0xB0;
				break;
			case L6470_HARDSTOP_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0xB8;
				break;
			case L6470_SOFTHIZ_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0xA0;
				break;
			case L6470_HARDHIZ_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0xA8;
				break;
			case L6470_GETSTATUS_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0xD0;
				/* Build the others bytes to transmit (SPD) */
				for (spibyte = 1; spibyte < 2 + 1; spibyte++) {
					*(pL6470_DaisyChainSpiTxStruct
							+ ((spibyte * L6470DAISYCHAINSIZE) + L6470_Id)) =
							0x00;
				}
				break;
			}
		} else {
#ifdef NUCLEO_USE_USART
			USART_Transmit(&huart2,
					"Both entered commands are addressing the same L6470.\n\r\n\r");
#endif
			return RESET;
		}
		CmdTxt_id++;
	} while ((CmdTxt_id < L6470DAISYCHAINSIZE)
			&& (((*((pL6470_TextCommandBundle + CmdTxt_id)->MotorName)) != '\0')
					|| ((*((pL6470_TextCommandBundle + CmdTxt_id)->CommandName))
							!= '\0')
					|| ((*((pL6470_TextCommandBundle + CmdTxt_id)->Param[0]))
							!= '\0')
					|| ((*((pL6470_TextCommandBundle + CmdTxt_id)->Param[1]))
							!= '\0')
					|| ((*((pL6470_TextCommandBundle + CmdTxt_id)->Param[2]))
							!= '\0')));

	return SET;
}

/**
 * @brief Decode the command string entered via USART
 * @retval None
 * @note It use two function, one to split the whole entered command string and
 *       another one to check for the application command
 */
uint32_t* USART_DecodeTextString(uint8_t *pTextString,
		sL6470_TextCommandBundle *pL6470_TextCommandBundle,
		uint8_t* pL6470_DaisyChainSpiTxStruct,
		uint8_t* pL6470_DaisyChainSpiRxStruct) {
	static uint32_t ReceivedValue[L6470DAISYCHAINSIZE];
	uint8_t L6470_Id;
	eL6470_RegId_t L6470_RegId;
	uint8_t PARAMLengthBytes; /* The number of bytes related to the numeric value for the addressed register */
	eHexFormat HexFormat;

	if (USART_SplitTextString(pTextString, pL6470_TextCommandBundle)
			&& USART_CheckTextCommandBundle(pL6470_TextCommandBundle,
					pL6470_DaisyChainSpiTxStruct)) {
#ifdef NUCLEO_USE_USART
		USART_Transmit(&huart2,
				"Perform the entered L6470 Application Command...\n\r");
#endif
		L6470_DaisyChainCommand(pL6470_DaisyChainSpiTxStruct,
				pL6470_DaisyChainSpiRxStruct);

		/* Check if a value has to be returned */
		for (L6470_Id = 0; L6470_Id < L6470DAISYCHAINSIZE; L6470_Id++) {
			/* Reset the value before fill with the new value */
			ReceivedValue[L6470_Id] = 0x00;

			if ((*(pL6470_DaisyChainSpiTxStruct
					+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) & 0xE0) == 0x20) // The AppCmd has been "GetParam"
					{
				/* The length, in byte, of this register (PARAM) is... */
				/* Check for the Register address */
				L6470_RegId = (eL6470_RegId_t) 0;
				while ((*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) & 0x1F)
						!= (L6470_Register[L6470_RegId].Address))
					L6470_RegId++;
				PARAMLengthBytes = L6470_Register[L6470_RegId].LengthByte;
				switch (PARAMLengthBytes) {
				case 1:
					HexFormat = BYTE_F;
					break;
				case 2:
					HexFormat = WORD_F;
					break;
				default:
					HexFormat = DOUBLEWORD_F;
					break;
				}

				ReceivedValue[L6470_Id] = L6470_ExtractReturnedData(L6470_Id,
						pL6470_DaisyChainSpiRxStruct, PARAMLengthBytes);

#ifdef NUCLEO_USE_USART
				USART_Transmit(&huart2,
						(uint8_t*) (L6470_DaisyChainMnemonic[L6470_Id].L6470IdMnemonic));
				USART_Transmit(&huart2, " ");
				USART_Transmit(&huart2,
						(uint8_t*) (L6470_Register[L6470_RegId].Name));
				USART_Transmit(&huart2, " value is 0x");

				USART_Transmit(&huart2,
						num2hex(ReceivedValue[L6470_Id], HexFormat));

				USART_Transmit(&huart2, "\n\r");
#endif        
			}

			if (*(pL6470_DaisyChainSpiTxStruct
					+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) == 0xD0) // The AppCmd has been "GetStatus"
					{
				ReceivedValue[L6470_Id] = L6470_ExtractReturnedData(L6470_Id,
						pL6470_DaisyChainSpiRxStruct, 2);

#ifdef NUCLEO_USE_USART
				USART_Transmit(&huart2,
						(uint8_t*) (L6470_DaisyChainMnemonic[L6470_Id].L6470IdMnemonic));
				USART_Transmit(&huart2, " STATUS value is 0x");

				USART_Transmit(&huart2,
						num2hex(ReceivedValue[L6470_Id], WORD_F));

				USART_Transmit(&huart2, "\n\r");
#endif        
			}
		}
#ifdef NUCLEO_USE_USART
		USART_Transmit(&huart2, "\n\r");
#endif    
	} else {
#ifdef NUCLEO_USE_USART
		USART_Transmit(&huart2, "Please, enter a new command string!\n\r\n\r");
#endif
	}

	return ReceivedValue;
}

/**
 * @brief  This function compares two text strings.
 * @param  TextString1 The pointer to the 1st text string to compare.
 * @param  TextString2 The pointer to the 2nd text string to compare.
 * @retval FlagStatus    SET or RESET related the comparison.
 */
FlagStatus CompareTwoTextString(uint8_t* TextString1, uint8_t* TextString2) {
	uint8_t i; /* to index the two text strings to be compared */
	uint8_t c1, c2; /* to store the two characters to be compared */

	i = 0;

	do {
		c1 = *(TextString1 + i);
		c2 = *(TextString2 + i);

		if (c1 != c2) {
			return RESET;
		}
		i++;
	} while ((c1 != '\0') && (c2 != '\0'));

